# Rebar Bend Data Crank Straight Length 1 Property

Source: https://www.revitapidocs.com/2026/dbdd987a-4c8a-b87f-a5ef-047c7c25e568.htm

---

| Rebar Bend Data Crank Straight Length 1 Property |
| --- |

Identifies the crank straight length at the end.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankStraightLength1 { get; }
```

```
Public ReadOnly Property CrankStraightLength1 As Double
	Get
```

```
public:
property double CrankStraightLength1 {
	double get ();
}
```

```
member CrankStraightLength1 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace